# команда "старт"
WELCOME_MESSAGE = (
    "Здравствуйте\\!\n\nЗдесь вы сможете приобрести "
    "подписку в группу Альфа\\.\n\n"
    "*Alpha Group* \\- это закрытое сообщество, в "
    "котором я делюсь всеми своими сделками\\. \n\n"
    "В сигналы вхожу на основе on\\-chain метрик и "
    "технического анализа\\.\n\nТорговля на фьючерсах и споте\\. "
    "Для ознакомления с тарифами или покупки посетите раздел\n"
    '*\\"📆Тарифные планы\\"*\n\n✍️ По вопросам пишите\\: \\@Focus\\_XO'
)

# команда "помощь"
HELP_MESSAGE = (
    "🤝 *Поддержка* \n\n📨 По всем интересующим " "вопросам — \\@Focus\\_XO"
)

# команда "тарифы"
TARIFFS_MESSAGE = (
    "🗓 *Тарифные планы*\nДля того, чтобы ознакомиться "
    "с тарифным планом, выберите необходимый, "
    "нажав на соответствующую кнопку 👇"
)

# оплата тарифа
PAYMENT_MESSAGE = (
    "*{name} \\| {period} дней \\| {price} USDT*\n\n"
    'Для оплаты подписки нажмите кнопку  \n*\\"💳  Оплатить\\"*\n\n'
    'После оплаты нажмите кнопку  \n*\\"✅  Подтвердить оплату\\"*'
)

# оплата тарифа
CHECK_PAYMENT_MESSAGE = (
    "Транзакция не подтверждена. Повторите попытку через 15 сек"
)

# сообщение об успешной оплате
SUCCESS_PAYMENT_MESSAGE = (
    "Оплата прошла успешно  ✅\n\nЭти приглашения для тебя 👇 "
)
